#!/usr/bin/env python
# coding: utf-8

# In[1]:


#1.หอยตัวหนึ่ง ตกลงไปในบ่อที่มีความสูง H เมตร มันพยายามจะไต่ให้ถึงปากบ่อ ในเวลากลางวันหอยไต่ขึ้นไปได้ U เมตร เวลากลางคืนมันนอนหลับจึงไม่ได้ไต่แต่กลับไถลลงมาเป็นระยะทาง D เมตร ให้เขียนโปรแกรมเพื่อหาว่าหอยจะใช้เวลากี่วันในการไต่ออกจากบ่อ (กำหนดให้หอยเริ่มไต่ในเวลากลางวัน)
H = int(input("H: "))
U = int(input("U: "))
D = int(input("D: "))
k = 0
day = 1
while True:
    k = k+U
    if k>=H:
     break
    k = k-D
    day = day+1
print(day,"day(s).")


# In[2]:


#2.ให้เขียนโปรแกรมรับจำนวนเต็ม M และ N จากนั้นพิมพ์เลขตั้งแต่ 1 ถึง M ที่ N หารลงตัว 
m = int(input("Enter M: "))
n = int(input("Enter N: "))
for x in range(1,m+1):
    if  x%n == 0:
        print(x)


# In[3]:


#3.ร้านขายขนมร้านหนึ่ง พยายามเพิ่มยอดขายโดยการเสนอโปรโมชั่นพิเศษ ถ้าคุณซื้อขนมมากกว่า 5 ห่อ ที่มีมูลค่ารวมเกิน 60 บาท คุณจะได้ส่วนลด 10% 
count = int(input("ต้องการขนม: "))
money = int(input("ราคา: "))
if count > 5 and money > 60:
   s = money-money*0.1
else:
   s = money
print("You have to pay",int(s),"bath.")


# In[4]:


#4.มดตัวหนึ่ง ตกลงมาจากต้นไม้ที่มีความสูง H เมตร มันพยายามจะไต่ขึ้นไปที่เดิม ในเวลากลางวันมดไต่ขึ้นไปได้ U เมตร เวลากลางคืนมันหมดแรงจึงไม่ได้ไต่แต่กลับไถลลงมาเป็นระยะทาง D เมตร ให้เขียนโปรแกรมเพื่อหาว่ามดจะใช้เวลากี่วันในการไต่ต้นไม้ขึ้นไปที่เดิม (กำหนดให้มดเริ่มไต่ในเวลากลางวัน)
H = int(input("H: "))
U = int(input("U: "))
D = int(input("D: "))
k = 0
day = 1
while True:
    k = k+U
    if k>=H:
     break
    k = k-D
    day = day+1
print(day,"day(s).")


# In[5]:


#5.มาลีขายปลาไป 19 กิโลกรัม ราคากิโลกรัมละ  20 บาท เอาเงินที่ขายได้ไปซื้อซูชิราคาชิ้นละ 10 บาท มาลีจะซื้อชิได้กี่ผล *กำหนดให้ได้ซูชิ 38 ชิ้น*
F=int(input("ขายปลาไป:"))
S=int(input("ราคากิโลกรัมละ:"))
Sushi=int(input("ซูชิชิ้นละ:"))
money=F*S
count = int(money//Sushi)
print("จะได้ซูชิปริมาณ:",count,"ชิ้น")
if count < 1:
    print("ไม่สามารถซื้อได้")
elif count > 40:
    print("เกินจำนวนที่ต้องการ")
else :
   count == 38
   print("ได้ครบตามจำนวน")


# In[6]:


#6.ให้เขียนโปรแกรมรับจำนวนเต็ม L และ G จากนั้นพิมพ์เลขตั้งแต่ 1 ถึง L ที่ G หารลงตัว 
l = int(input("Enter L: "))
g = int(input("Enter G: "))
for x in range(1,l+1):
    if  x%g == 0:
        print(x)


# In[7]:


#7.ร้านขายกล้วยร้านหนึ่ง พยายามเพิ่มยอดขายโดยการเสนอโปรโมชั่นพิเศษ ถ้าคุณซื้อกล้วยมากกว่า 6 หวี ที่มีมูลค่ารวมเกิน 50 บาท คุณจะได้ส่วนลด 20% 
count = int(input("ต้องการกล้วย: "))
money = int(input("ราคา: "))
if count > 6 and money > 50:
   s = money-money*0.1
else:
   s = money
print("You have to pay",int(s),"bath.")


# In[8]:


#8.มีนามีเงิน 3000 บาทซื้อหมูไป 19 กิโลกรัม ราคากิโลกรัมละ  120 บาท เอาเงินที่เหลือไปซื้อโดนัทราคาชิ้นละ 10 บาท มาลีจะซื้อโดนัทได้กี่ชิ้น *กำหนดให้ได้โดนัท 72 ชิ้น*
M=int(input("มีนามีเงิน:"))
B=int(input("ซื้อหมูไป:"))
P=int(input("หมูกิโลกรัมล่ะ:"))
Pig=B*P
D=int(input("โดนัทชิ้นละ:"))
money=(M-(B*P))
count = int(money//D)
print("จะได้โดนัทปริมาณ:",count,"ชิ้น")
if count < 1:
    print("ไม่สามารถซื้อได้")
elif count > 80:
    print("เกินจำนวนที่ต้องการ")
else :
   count == 72
   print("ได้ครบตามจำนวน")


# In[9]:


#9.เขียนโปรแกรมรับจำนวนเต็มบวก 1 จำนวน จากนั้นให้แสดงผลลัพธ์เป็นจำนวนเต็มดังกล่าวที่เขียนอยู่ในรูปของตัวเลขฐานสอง
x = int(input("Enter number: "))
x0 = x
sum = ''
d = 0
z = 0
while True:
   y = int(x%2)
   x = int(x/2)
   sum = str(y)+sum
   if y==1:
      z = z+2**d
   if z==x0:
      break
   d = d+1
z = int(sum)
print(z)


# In[10]:


#10.เขียนโปรแกรมรับจำนวนเต็ม จากนั้นพิมพ์จำนวนเต็มดังกล่าวออกมาทีละหลัก หลักละ 1 บรรทัด โดยพิมพ์จากหลักหน่วยก่อน
x = input("Enter number: ")
d = len(x)-1
while d != -1:
   print(x[d])
   d = d-1

